mermaid improvements
